user-4.1/tutorials/surfaceTracking/interTrackFoam/tangSurfTenTest3D/0.org/pointMotionU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointMotionU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 1 -1 0 0 0 0];

internalField       uniform (0 0 0);

boundaryField
{
    trackedSurface
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    left
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    right
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    top
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    front
    {
        type            slip;
    }
    back
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
