user-4.1/tutorials/surfaceTracking/interTrackFoam/tangSurfTenTest3D/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default        CrankNicolson 0.9;
}

gradSchemes
{
    default        leastSquares;
}

divSchemes
{
    default        Gauss linear;
    div(rho*phi,U) Gauss linearUpwind leastSquares;
    div(phi,c)     Gauss linearUpwind leastSquares;
}

laplacianSchemes
{
    default        Gauss linear corrected;
}

interpolationSchemes
{
    default        linear;
}

// ************************************************************************* //
